5-h.yaml
config:
  target: 'https://gateway-server.dev-twin.world/space'
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 10
    - duration: 30
      arrivalRate: 15
    - duration: 60
      arrivalRate: 20
    - duration: 30
      arrivalRate: 10
  variables: # 토큰 변수 확인
    token: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJhY2NvdW50SWQiOiIwMUdYUUJRUkZCRjVNRjE1TkNLQURTMUdDSCIsInNlcnZpY2VJZCI6IjAxR1hENzU1MDg5NFBHSFMwS0JUWkVTMVExIiwic2VydmljZU5hbWUiOiJUd2lud29ybGQiLCJ0b2tlbklkIjoiMDFINTFCUTVETUVIN040N0hKSEpDTjdBQ00iLCJpYXQiOjE2ODkwNDE3MzcsImV4cCI6MTY4OTA0NTMzN30.GhEIEd6P7KXg0aR1gy-qFRFBW_WakZ--FUnKwa4drZE'
    position0: # position 랜덤으로 지정되도록
      - 0
      - 1
      - 2
      - 3
    position1:
      - 6
      - 7
      - 8
      - 9
    position2:
      - 4
      - 5
      - 6
      - 7

scenarios:
  - name: '5-h, /space/contents/{spaceId}' #콘텐츠 첫 배치 insert, input body
    flow:
      - loop:
          - post:
              url: '/contents/01GZWX35QH4FMGHASPQTKRC8A1'
              headers:
                Authorization: 'Bearer {{ token }}'
              json: # input data
                - type: item
                  transform:
                    position:
                      x: '{{ position0 }}'
                      y: '{{ position1 }}'
                      z: '{{ position2 }}'
                    rotation:
                      x: '{{ position1 }}'
                      y: '{{ position2 }}'
                      z: '{{ position0 }}'
                      w: '{{ position1 }}'
                    scale:
                      x: '{{ position2 }}'
                      y: '{{ position0 }}'
                      z: '{{ position1 }}'
                  viewId: '{{ $randomNumber(1,10000) }}' # viewId 랜덤으로 입력
                  mediaId: 'media_id'
                  isLocked: false
                  isGroup: false
        count: 10